gicking/STM8_headers/SVD/STM8AF6148.svd
        <register>
          <name>BKR</name>
          <description>TIM1 break register</description>
          <size>8</size>
          <addressOffset>0x001D</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSSI</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSSR</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKP</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AOE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR</name>
          <description>TIM1 deadtime register</description>
          <size>8</size>
          <addressOffset>0x001E</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DTG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OISR</name>
          <description>TIM1 output idle state register</description>
          <size>8</size>
          <addressOffset>0x001F</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>OIS1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS1N</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS2N</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS3</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS3N</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS4</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
      <interrupt>
        <name>Interrupt_IRQ11</name>
        <description>Interrupt_IRQ11 interrupt</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>Interrupt_IRQ12</name>
        <description>Interrupt_IRQ12 interrupt</description>
        <value>12</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TIM2</name>
      <baseAddress>0x5300</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>21</size>
        <usage>registers</usage>
      </addressBlock>
      <description>TIM2</description>
      <groupName>Timer</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>TIM2 control register 1</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>URS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPM</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARPE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>TIM2 interrupt enable register</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>UIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1IE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3IE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>TIM2 status register 1</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>UIF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1IF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3IF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>TIM2 status register 2</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC10F</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC20F</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC30F</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>TIM2 event generation register</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>UG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1G</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2G</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3G</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TG</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1</name>
          <description>TIM2 capture/compare mode register 1</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC1S0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1S1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1PE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1M0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1M1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1M2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2</name>
          <description>TIM2 capture/compare mode register 2</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC2S0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2S1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2PE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2M0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2M1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2M2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR3</name>
          <description>TIM2 capture/compare mode register 3</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC3S0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3S1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC3PE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC3M0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC3M1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC3M2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER1</name>
          <description>TIM2 capture/compare enable register 1</description>
          <size>8</size>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC1E</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1P</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2E</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2P</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER2</name>
          <description>TIM2 capture/compare enable register 2</description>
          <size>8</size>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC3E</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3P</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTRH</name>
          <description>TIM2 counter high</description>
          <size>8</size>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTRL</name>
          <description>TIM2 counter low</description>
          <size>8</size>
          <addressOffset>0x000B</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSCR</name>
          <description>TIM2 prescaler register</description>
          <size>8</size>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PSC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRH</name>
          <description>TIM2 auto-reload register high</description>
          <size>8</size>
          <addressOffset>0x000D</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRL</name>
          <description>TIM2 auto-reload register low</description>
          <size>8</size>
          <addressOffset>0x000E</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1H</name>
          <description>TIM2 capture/compare register 1 high</description>
          <size>8</size>
          <addressOffset>0x000F</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1L</name>
          <description>TIM2 capture/compare register 1 low</description>
          <size>8</size>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2H</name>
          <description>TIM2 capture/compare register 2 high</description>
          <size>8</size>
          <addressOffset>0x0011</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2L</name>
          <description>TIM2 capture/compare register 2 low</description>
          <size>8</size>
          <addressOffset>0x0012</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3H</name>
          <description>TIM2 capture/compare register 3 high</description>
          <size>8</size>
          <addressOffset>0x0013</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3L</name>
          <description>TIM2 capture/compare register 3 low</description>
          <size>8</size>
          <addressOffset>0x0014</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
